{
  "schema_version": "1.0",
  "computed_at": "2025-09-27T19:00:06Z",
  "tour_id": "boomtown_to_boomtech",
  "title": "Untitled Tour",
  "city": "San Jose",
  "city_code": "sjc",
  "description": "How a quiet agricultural town reinvented itself—twice.",
  "mode": "walking",
  "effort_level": "moderate",
  "route_polyline": "ajzbFpr}fV_Al@FLGBWTGMGDe@Za@Zg@VUF@DDLZhAM@A@EG}@l@OPKWURHRC@aC~AQFYPACMHsA~@u@j@GDACc@\\FLgAr@uBrAgBnAaAn@DPGL?Hp@lBK[LI@BHRISCIu@wBQq@Eq@?i@@MFE@EFw@MF?OCg@EYe@yAs@kBBAEOCBYu@s@iBFG@GDWEa@~EgDJGEKBEAC^W@Bf@[zAcAnA{@rA}@p@e@GQQSWs@Ki@Qe@CEIHMYJIO_@Se@]}@Qi@GQIFISJG_@u@_@{@a@kAEBEMCGBCq@mBIS]aAGDGSEIFESm@Y_Ac@gAIDM[@CM]_@_Ag@uAA@CEIW@AGQs@kBSi@EKC@ISDCIS][KWCI[{@",
  "summary": {
    "stop_count": 5,
    "total_distance_km": 2.55,
    "total_walking_minutes": 36,
    "estimated_tour_duration_min": 86,
    "effort_level": "moderate"
  },
  "centroid": {
    "lat": 37.33531,
    "lng": -121.891009
  },
  "actual_start_id": "the-tech-interactive",
  "stops": [
    {
      "poi_id": "the-tech-interactive",
      "name": "The Tech Interactive",
      "lat": 37.3314903,
      "lng": -121.8902357,
      "address": "201 S Market St, San Jose, CA 95113, United States",
      "teaser": "A hands-on hub of invention and applied tech in downtown San José — the modern pulse of Silicon Valley's public-facing '",
      "narration_text": "Welcome to the Boomtown to Boomtech tour in San Jose! We’ll trace how a frontier pueblo and orchard town morphed into a world tech capital. From adobe walls to IMAX domes and civil rights icons to AI, we’ll follow the people, industries, and ideas that reshaped this city—and the world.\n\nYou can’t miss this place—The Tech Interactive—its bold mango and azure colors pop out against downtown San Jose. That’s Ricardo Legorreta’s work. He was a Mexican architect who believed public spaces should be both playful and welcoming. Look at the way the building hugs the edge of Plaza de César Chávez. All those sharp angles and sunlit courtyards, meant to draw you in, not just intimidate you with glass and steel. It’s become a landmark, almost by accident—a local point of pride since it opened in 1998.\n\nBut the story starts way before Legorreta put pen to paper. Back in 1978, a group from the Junior League—mostly women, many with young kids—wanted a hands-on science museum for San Jose. They were tired of seeing the best science centers in San Francisco or Los Angeles. So they rolled up their sleeves and built one from scratch. It was a grassroots project—no big donors, no splashy launches. Just a rented storefront and a lot of volunteers soldering wires and painting walls. [pause]\n\nFast forward to today. The Tech’s mission has shifted. It’s not just about looking at exhibits. Everything here is interactive. They even rebranded in 2019 to make that clear—this is a place where you touch, build, and experiment. The idea is that learning happens best when you get your hands dirty.\n\nStep inside, and you’ll see what I mean. The IMAX Dome Theater is right there—a huge, curved screen, 50 feet high. It’s the only domed IMAX in Northern California. In 1998, it was the first dome in the world to get a laser projector, which meant brighter colors and sharper images. School groups love it. But it’s not just for kids—NASA scientists have premiered their Mars landing films here, and the sound system rattles your seat.\n\nThe exhibits? They’re not static displays. Cyber Detectives lets you try to hack into a virtual network, track down digital footprints, or see how ransomware works. Silicon Valley isn’t just apps and gadgets—it’s the world’s cybersecurity capital, and this gallery puts you in the hot seat. Want to see if you could crack a code or spot a phishing scam? Here’s your chance. [pause]\n\nSolve for Earth, which opened in 2021, is all about climate change—but not in a doom-and-gloom way. It’s data-driven, with real numbers and city-building challenges. You get to design a neighborhood, juggle budgets, and see the carbon impact of your choices. It’s a little stressful—like a real city council meeting. And that’s the point. Decisions here have consequences.\n\nThen there’s the Tech Challenge. If you grew up in the South Bay, you probably know someone who’s done it. Every year for more than three decades, thousands of students form teams to tackle real-world engineering problems. Past challenges have included building bridges from spaghetti, launching payloads with rubber bands, or making water filters out of recycled trash. Some teams pull all-nighters. A few go on to become engineers at Google or Tesla. It’s Silicon Valley’s science fair on steroids, and it’s been seeding the region’s maker culture since the 1980s.\n\nThe BioDesign Studio is where things get really hands-on. You can extract DNA from strawberries or design bacteria that eat oil spills. This isn’t just for show. Biotech is a huge part of the Bay Area economy, and the tools here are the same ones you’d find in a real lab—centrifuges, micropipettes, gene-editing kits. Sometimes you’ll see a middle schooler pipetting DNA while a Stanford grad student looks on, both equally excited.\n\nDon’t miss the Engineering Lab’s shake table. San Jose sits on the edge of the San Andreas Fault. Here, you build your own model skyscraper and see if it survives a simulated quake. It’s fun, but it’s also a real engineering lesson. Some designs crumble right away. Others surprise you and stand tall. The point is, in a place where earthquakes are a fact of life, everyone should know a bit about seismic safety.\n\nSpace Lab, up on the second floor, is a nod to the valley’s aerospace roots. The Martian terrain is bumpy, full of red rocks and sand. Kids—and more than a few adults—try to drive little rovers over it. It’s a reminder that Silicon Valley’s story started with defense contractors and rocket engineers long before social media apps.\n\nThere’s history here, too. A model of the 1951 Stanford Industrial Park shows how Silicon Valley’s sprawl began. It’s easy to forget, but this place was once all orchards and farmland. Then came Shockley Semiconductor in 1956, the first real chipmaker, which spun off Fairchild and eventually Intel. The museum doesn’t sugarcoat it—Shockley was a Nobel winner but also a notorious racist and a terrible boss. His team, the “traitorous eight,” left him to start Fairchild. That drama is the origin story of the entire tech industry.\n\nThe 1980s networking boom—Cisco, Sun Microsystems—gets a whole section. The Tech explains how routers and servers turned the valley into the internet’s backbone. And it keeps up with the times. The mobile and cloud era, the arrival of AI, even the 2015–2022 push to connect downtown with new transit and tech campuses—it’s all here, woven into the exhibits and architecture.\n\nWhat’s it like on a busy day? The air buzzes with school groups, startup founders, tourists, and families. There’s a bit of chaos, a lot of curiosity. Some people come for nostalgia. Others come to see what’s next. But everyone leaves with a sense that innovation isn’t just for the few—it’s for anyone willing to tinker, break things, and try again.",
      "narration_audio": "/tours/sjc/boomtown_to_boomtech/audio/stops/the-tech-interactive.mp3",
      "images": []
    },
    {
      "poi_id": "san-pedro-square-market",
      "name": "San Pedro Square Market",
      "lat": 37.3365763,
      "lng": -121.8941024,
      "address": "87 N San Pedro St, San Jose, CA 95110, United States",
      "teaser": "A revitalized food-and-music plaza built around the Peralta Adobe — shows downtown's shift from civic plaza to mixed-use",
      "narration_text": "Welcome to San Pedro Square Market. You’re standing in the heart of a place that’s been many things: a dusty plaza at the city’s edge, a 1900s hotel lobby, a 1990s ghost town, and now, the after-hours living room for downtown San Jose.\n\nThe Market opened in 2011, but this spot’s history goes back a lot further. If you look around, you’ll see Peralta Adobe Plaza—a brick-and-timber structure from 1797. It’s the oldest building in San Jose. Built when California was still Spanish, the adobe once belonged to Luís María Peralta, a soldier who ran cattle here. It’s a rare survivor, surrounded by espresso bars and bao stands, still standing after earthquakes, redevelopment, and every wave of newcomers who’ve shaped this city.\n\nThe Market itself is all about layers—old and new pressed together. That’s not just a vibe. You can see it in the food stalls: Vietnamese, Mexican, Italian, Filipino, American comfort food. Each vendor is a small business, many of them family-run, with roots in the immigrant communities that built San Jose. At night, you’ll hear live music—sometimes salsa, sometimes indie rock, sometimes a Filipino pop group. It’s loud, a little chaotic, and full of energy, channeling the immigrant hustle and startup drive that made this city what it is.\n\nNotice the big, communal tables. They’re not an accident. The Market was designed to get strangers to sit together, to revive a part of downtown that was mostly empty after dark. In the 1990s, San Pedro Street was almost forgotten. Tech money was pouring into the South Bay, but the center of San Jose lagged behind. The dotcom crash in 2000 nearly killed what momentum there was. But the Market’s owners bet that people wanted to gather again, and that food and music could bring them back. COVID-19 put that theory to the test—overnight, the Market turned into an open-air lifeline, with plazas that let people eat, drink, and see friends safely. San Pedro became the city’s living room, and it’s never really given that up.\n\nNow, look for Three Sisters Hall. It’s named for the Castro–Fallon family union—three sisters who married into the Fallon family, tying together Mexican and American roots. It’s a nod to the tangled, sometimes messy history of conquest, marriage, and property that shaped early California. The Fallon House itself was once a 25-room hotel, built around 1900, when this was the social center of San Jose. Politicians, ranchers, and gamblers all passed through. The 1906 earthquake changed everything. When San Francisco’s capital shifted south, San Pedro Square got a jolt of new energy—and new money.\n\nThere’s a darker side, too. Manny’s Cellar, down in the Fallon House basement, was once a notorious dive. Local lore says city officials and journalists cut deals over whiskey here. If you ask old-timers, they’ll tell you about the fights, the backroom bargains, and the regulars who never left.\n\nThe plaza partners with History San José to keep those stories alive. Sometimes you’ll see pop-up exhibits or guided walks. They’re reminders that this isn’t just a food hall—it’s a living museum, where the past isn’t always comfortable. Case in point: the statue of Thomas Fallon. He led the American conquest of San Jose in 1846, raised the U.S. flag over the city, and made his fortune here. But he also helped displace the original Mexican landowners. In 2023, after years of debate, his statue was removed. The fight wasn’t just about a piece of bronze. It was about memory, who gets honored, and who gets erased.\n\nSo as you walk through the Market, take a moment to look for the details. The weathered adobe, the old hotel bricks, the new neon signs. Smell the tortillas and roasted coffee. Listen for the sound of live music—six nights a week, a reminder that San Jose is always changing, always mixing old and new. This place has seen booms, busts, and comebacks. It’s never been perfect. But it’s always been alive.\n\n[pause]\n\nThat’s San Pedro Square Market—past and present, side by side, with a few ghosts still hanging around.",
      "narration_audio": "/tours/sjc/boomtown_to_boomtech/audio/stops/san-pedro-square-market.mp3",
      "images": []
    },
    {
      "poi_id": "gonzales-peralta-adobe--fallon-house-historic-site",
      "name": "Gonzales-Peralta Adobe & Fallon House Historic Site",
      "lat": 37.3368622,
      "lng": -121.8948417,
      "address": "175 W St John St, San Jose, CA 95110, United States",
      "teaser": "San José's oldest standing building (1797) and a Victorian mayor's mansion across the street — where pueblo, Mexican-era",
      "narration_text": "Here we are at 175 West St. John Street, where San Jose’s past is still standing, sun-baked and sturdy. You’re looking at the Peralta Adobe, built back in 1797 by Manuel Gonzales—one of the city’s original settlers, and an Apache by birth. Picture this: a tiny, rough pueblo, just a few dozen families, livestock everywhere, and a Spanish empire hanging on by a thread at the edge of California. Gonzales was a settler, a soldier, and—by necessity—a jack-of-all-trades. He raised these nearly two-foot-thick adobe walls with his own hands, stacking sun-dried bricks to keep out both the summer heat and the winter chills. No insulation, just earth, straw, and grit.\n\nWalk around and notice how compact it is. This was not a mansion; it was survival. No glass in the windows—just wooden shutters. No running water, no plumbing, no privacy. Out front is the horno, the dome-shaped outdoor oven. That’s where bread was baked, stews simmered, and everyone’s laundry dried on the same line. The horno was the heart of the home, and the neighborhood gossip column, too.\n\nLuis María Peralta took over in 1808. He was a sergeant and a big deal in Spanish California. He added the porch, the kitchen, and a chimney—a nod to comfort and maybe a bit of ambition. Peralta had been given thousands of acres for his service. But even he wasn’t immune to the mud and dust of frontier life. His upgrades turned this from a shack into a real home, at least by the standards of the time. [pause]\n\nNow, look at those walls. Nearly two feet thick, made of adobe—sun-dried mud bricks. Why? Earthquakes. Heat. Cold. Adobe flexes, breathes, and cracks, but it rarely collapses. It’s cheap and local. The grass and mud came from right here, scooped from the Guadalupe River floodplain. And that’s why this building is still here, after centuries of earthquakes and change.\n\nThe adobe’s job changed as the city grew. By the 1870s, the old house was just a warehouse, storing fruit and wine for the Valley of Heart’s Delight. Back then, orchards stretched for miles—apricots, plums, cherries. No freeways, no tech, just wagons and sweat. The adobe was a cool, dry spot to stash produce before the trains rolled out.\n\nBy the 1960s, San Jose had paved over most of its past. This was the last original structure from the old pueblo. The city almost bulldozed it, but local historians fought back. In 1966, the city bought and restored the adobe, saving the last link to San Jose’s Spanish beginnings. [pause]\n\nNow, let’s cross the street—at least in our minds—to the Fallon House. Built in 1855, this was Victorian show-off territory. Thomas Fallon, the owner, was an Irish immigrant, gold rush adventurer, and—briefly—mayor of San Jose. Fallon married Carmel Castro, whose family owned huge ranches in the valley. Their marriage was a merger of new money and old land.\n\nThis house had fifteen rooms, all furnished in high Victorian style. Picture parlor games, stiff collars, calling cards, and kerosene lamps. Fallon liked to host; he was always working the room, shaking hands, making deals. San Jose was still more orchard than city, but Fallon’s house pointed the way forward—civic ambition, modern comforts, and a little bit of showbiz.\n\nBut not everything was so polished. The city had its share of rough politics and drama. Fallon’s mayoral term was short, and he made enemies. Carmel, meanwhile, had to navigate the shifting fortunes of her family as the old Spanish land grants broke up and new Americans poured in. [pause]\n\nIf you look around, you’ll notice how these two buildings tell two sides of the same story: adobe and brick, Spanish and American, survival and aspiration. Today, the neighborhood is tech offices and apartments, but the bones of old San Jose are still here. [pause]\n\nThese buildings are stops on the Juan Bautista de Anza National Historic Trail, which marks the route of the 1776 Spanish expedition that linked Mexico to San Francisco Bay. The trail, the adobe, the house—they’re reminders that this valley has always been a crossroads, where empires, ambitions, and everyday life collide.\n\nSo take a moment. Run your hand along the adobe wall. Imagine the heat of the oven, the chatter on the porch, the hum of city life just beginning to stir. That’s San Jose’s real foundation—mud, ambition, and a lot of improvisation.",
      "narration_audio": "/tours/sjc/boomtown_to_boomtech/audio/stops/gonzales-peralta-adobe-fallon-house-historic-site.mp3",
      "images": []
    },
    {
      "poi_id": "luis-mara-peralta-adobe",
      "name": "Luis María Peralta Adobe",
      "lat": 37.3364337,
      "lng": -121.8947942,
      "address": "180 W St John St, San Jose, CA 95110, United States",
      "teaser": "San José's oldest standing structure and a neighboring Victorian mansion — a tangible jump from Pueblo-era adobe life to",
      "narration_text": "Welcome to the Luis María Peralta Adobe—San Jose’s oldest address still standing. You’re looking at a house built in 1797, back when this place was a frontier outpost of the Spanish Empire. The man behind it, Manuel Gonzales, was a soldier, a settler, and later, San Jose’s second alcalde—that’s the Spanish word for mayor. Imagine running the town from inside these thick adobe walls, holding meetings in a living room made of mud and straw.\n\nThe walls here are two feet thick. Not for show. That’s insulation, frontier style—keeps out the summer heat and the winter chill. You can see the old wooden beams, the clay bricks, the hand-forged nails. No glass in the windows at first, just animal hides to keep out the rain. The first house Gonzales built was down by the river, but it flooded. So he picked this spot, higher and drier. Early San Jose urban planning—learn by doing.\n\nA few decades later, Luis María Peralta takes over as comisionado—basically the Spanish crown’s local fixer. Peralta’s a big name around here. He’s the one who helps steer San Jose through the messy transition from Spanish to Mexican rule. Imagine the paperwork. Peralta isn’t just a bureaucrat, though. He’s a family man. He adds a porch, a kitchen, a real chimney. That’s a nod to Spanish and Californio customs, but also practical—more space, more comfort, less smoke in your eyes.\n\nPeralta’s story stretches way past these walls. He’s the guy who gets the Rancho San Antonio land grant—45,000 acres across what’s now the East Bay. Oakland, Berkeley, Alameda, all once Peralta turf. His kids inherit chunks of it, sparking generations of legal drama and family feuds. Land in California is power, and Peralta had a lot of both.\n\nBack here in San Jose, life is slower but no less ambitious. Peralta plants pears, peaches, grapes. The fruit isn’t just for the family—it feeds the growing town and ships out to the wider world. Grapes become wine. By the 1870s, this old adobe is a wine cellar. San Jose’s agricultural hustle long before tech.\n\nListen for a second. The sounds you hear—maybe a delivery truck, maybe laughter from the market—aren’t that different from what you’d hear two centuries ago. Carts, horses, neighbors arguing, kids playing. If you look closely, you can spot the outlines of old additions—the porch, the kitchen. Even the uneven floors tell stories. Each crack is a year, each patch a memory.\n\nThis house has seen more than most. Colonial officials, Mexican ranchers, Gold Rush fortune-seekers, immigrants, squatters, winemakers, and, later, preservationists fighting to save what’s left. In 1977, the state put it on a postage stamp. Suddenly, this little adobe was a symbol—California’s beginnings in miniature.\n\nIt’s also the first official site on the Juan Bautista de Anza National Historic Trail. The trail marks the route taken by Spanish settlers from Mexico to San Francisco Bay in 1776. The Peralta Adobe sits right at the crossroads of that story. Big history in a small space.\n\nToday, the adobe is the centerpiece of San Pedro Square Market. The city grew up around it, but the walls stayed put. This was a home, an office, a wine vault, a meeting place, and now, a reminder that San Jose wasn’t always silicon and glass. If you run your hand along the adobe, you can feel the grit of the original bricks. That’s the texture of 18th-century ambition—and survival.\n\nIt’s not a grand mansion. It’s practical, sturdy, a little battered. But it’s outlasted everything that came after it. The adobe’s legacy is endurance—through floods, revolutions, family drama, and tech booms. And here it is, at the heart of the city, holding stories you can touch.",
      "narration_audio": "/tours/sjc/boomtown_to_boomtech/audio/stops/luis-mara-peralta-adobe.mp3",
      "images": []
    },
    {
      "poi_id": "san-jos-state-university",
      "name": "San José State University",
      "lat": 37.3351874,
      "lng": -121.8810715,
      "address": "1 Washington Sq, San Jose, CA 95192, United States",
      "teaser": "A century-plus urban university in the heart of downtown — a continuing pipeline of engineers, entrepreneurs, and city-",
      "narration_text": "Welcome to San José State University, or SJSU—founded in 1857, back when California was still figuring out what it meant to be a state. This is the oldest public university in California. It started as a teacher’s college, training schoolmarms and schoolmasters for a wild, growing West. But look around now: glass, steel, and students from every walk of life. The place grew into an urban powerhouse, always tied to the pulse of San Jose itself.\n\nLet’s start with the Dr. Martin Luther King Jr. Library. Eight stories tall, opened in 2003. The city and the university joined forces on this one—a $177 million project. That’s not just a library, it’s a symbol. San Jose’s people and students sharing the same stacks, the same quiet spaces, the same ideas. You get college kids, retired engineers, families, all reading and learning together. Civic learning, at scale.\n\nHistory here isn’t just in the books. It’s cast in bronze. See the Victory Salute statue? Two men, fists raised in the air. That’s Tommie Smith and John Carlos, SJSU alumni. 1968 Olympics in Mexico City: they won gold and bronze in the 200-meter sprint, then raised their gloved fists on the podium. It was a protest against racial injustice, seen by millions. They paid a price—suspended from the team, threatened, careers cut short. But they changed the conversation. Now, their courage is immortalized right here, on the quad where they once trained. Their protest was born out of this campus—Smith and Carlos were part of the Olympic Project for Human Rights, a group led by SJSU sociologist Harry Edwards. Edwards (himself a former SJSU athlete) was radical, blunt, and didn’t care who he offended. He saw sports as a stage for civil rights. He pushed his athletes to think bigger than medals.\n\nLook for the Arch of Dignity, Equality, and Justice—built in 2008. It’s a sweeping mosaic arch, decorated with portraits of civil rights leaders. The university wanted civil rights to be part of the curriculum, not just in classrooms, but out here, under the open sky. Students walk under these faces every day: Martin Luther King Jr., Cesar Chavez, Dolores Huerta, Harvey Milk, and more. It’s a daily reminder that justice is unfinished work.\n\nSJSU’s commitment to justice goes back further than you might think. In 1930, it launched the first Justice Studies program in the country—the oldest policing degree in the U.S. The idea was to train police who were educated, reform-minded, and could serve a changing society. Today, SJSU’s justice grads work in law enforcement and policy all over California, trying to bridge the gap between police and the public.\n\nBut this campus has its shadows. In 1942, after Pearl Harbor, the U.S. government ordered all Japanese Americans on the West Coast to report for internment. Here, at the gym, Japanese American students and families registered before being shipped to camps. Wartime fear, racism, and government power—etched right into the ground here. Some of those students never came back.\n\nLet’s talk about judo. Coach Yoshihiro Uchida (oo-CHEE-da) started teaching here in 1940, before World War II. He’s a legend—helped get judo into the Olympics, trained generations of champions. His 1962 team won the first collegiate judo championship in the country. SJSU’s judo room became a sanctuary for Japanese American students after the war—a place where discipline, community, and sport mixed.\n\nDuring World War II, San Jose was swept up in the defense boom. Factories, electronics, and later, aerospace and computing. The Cold War and the Space Race meant big money and new ideas. SJSU pumped out engineers and scientists who went straight into the companies that made Silicon Valley: Shockley, Fairchild, later Cisco and Sun Microsystems. From classrooms to cleanrooms, students here were building the tech that would change the world.\n\nIn the 2010s, the university doubled down on cloud computing and AI labs. Tech companies started recruiting students straight from campus. SJSU learned from the dot-com bust—flexibility and career-ready skills became the new mantra. Today, students graduate ready to jump into jobs that didn’t even exist ten years ago.\n\nEvery day, 30,000 students walk these paths. Some live in dorms, some commute from across the Bay, some are the first in their family to go to college. They’re juggling jobs, families, dreams, and setbacks. On a hot day, you’ll see people stretched out on the grass, headphones on, laptops open. In the evening, the air cools, and the campus glows under city lights.\n\nLook around. This place is layered—old and new, triumph and tragedy, struggle and progress. Every brick and statue has a story. SJSU isn’t just a school. It’s a living piece of California’s past and future, always in motion.",
      "narration_audio": "/tours/sjc/boomtown_to_boomtech/audio/stops/san-jos-state-university.mp3",
      "images": []
    }
  ]
}