{
  "stops": [
    {
      "name": "Jaffa Port",
      "bullets": [
        "Jaffa Port is one of the world's oldest, active for over 7,000 years.",
        "In 1865, French engineers built the Jaffa Lighthouse, operational until 1966.",
        "The port was a major hub for exporting Jaffa oranges in the 19th century.",
        "In 1935, the 'Cement Incident' revealed a large cache of smuggled weapons.",
        "The port's decline began in the 1930s, overtaken by Haifa and Ashdod ports.",
        "Today, Jaffa Port is a vibrant cultural hub with restaurants and galleries.",
        "According to myth, Jonah embarked on his biblical journey from Jaffa Port.",
        "Napoleon landed here in 1799 during his campaign in the Middle East.",
        "The port was a key entry point for Jewish immigrants during the British Mandate.",
        "The port's history includes stories of piracy and naval battles.",
        "The Jaffa Lighthouse guided ships safely into the rocky harbor.",
        "Jaffa oranges became a symbol of Israeli agriculture, starting here."
      ]
    },
    {
      "name": "Ilana Goor Museum",
      "bullets": [
        "Built in 1742 as an inn for Jewish pilgrims to Jerusalem.",
        "Converted into an olive oil soap factory in the 19th century.",
        "Served as a synagogue for Libyan Jews in 1949.",
        "Ilana Goor purchased part of the building in 1983.",
        "Museum inaugurated in September 1995.",
        "Collection includes over 500 artworks by Goor and others.",
        "Features works by Henry Moore and Anselm Kiefer.",
        "Restoration revealed a hidden stone oven from the soap factory era.",
        "Ceiling constructed using 'beehive technique' with amphorae for insulation.",
        "Rooftop sculpture garden offers panoramic views of Jaffa and the Mediterranean.",
        "Hosted 'Totem and Taboo' exhibition featuring Israeli artists in 2019.",
        "Ilana Goor refers to the museum as her personal 'university'."
      ]
    },
    {
      "name": "Suspended Orange Tree",
      "bullets": [
        "Israeli artist Ran Morin created the Suspended Orange Tree in 1993.",
        "The installation features a real orange tree growing in a suspended clay pot.",
        "The tree is supported by metal cables attached to neighboring buildings.",
        "A hidden drip irrigation system sustains the tree's growth.",
        "The artwork symbolizes Jaffa's historical significance in the orange trade.",
        "Some interpret the suspended tree as representing the Jewish diaspora.",
        "The installation reflects the detachment between people and nature in modern life.",
        "Ran Morin is known for integrating full-sized trees into his sculptures.",
        "Nearby attractions include the Ilana Goor Museum and the Jaffa Flea Market."
      ]
    },
    {
      "name": "Jaffa Clock Tower",
      "bullets": [
        "Constructed between 1900 and 1903 to honor Sultan Abdul Hamid II's 25th reign anniversary.",
        "Initiated by Jewish businessman Joseph Bey Moyal, with contributions from Jaffa's diverse communities.",
        "Features two clocks; original mechanism crafted by Moritz Schoenberg from Rishon LeZion.",
        "One of seven Ottoman-era clock towers in present-day Israel and Palestinian territories.",
        "Underwent renovations in 1965 and 2001; added stained glass windows by artist Arie Koren.",
        "In 2021, Danish-Israeli clockmaker Susanne Kaufmann restored the malfunctioning clock mechanism.",
        "Located at the northern entrance of Jaffa, near the historic Jaffa Port and Ajami Beach.",
        "Adjacent to the Mahmoudiya Mosque, Jaffa's largest mosque, and the historic Saraya House.",
        "Served as a central hub in Jaffa, surrounded by markets, government buildings, and commercial centers.",
        "The tower's construction marked a cultural shift towards modernization and urbanization in Jaffa.",
        "The clock tower symbolizes Jaffa's rich history and cultural diversity, standing as a testament to the city's past and present."
      ]
    },
    {
      "name": "Jaffa Flea Market",
      "bullets": [
        "Established in the 19th century, Jaffa Flea Market began as a small market outside Jaffa's walls, catering to pilgrims with clothes and food.",
        "The market's main thoroughfare, Olei Zion Street, was formerly Al-Salahi Street before its renaming.",
        "The name 'flea market' originates from the French term for markets selling old furniture infested with fleas.",
        "The market is divided into three areas: two pedestrian-only streets, an open lot, and Olei Zion Street with established stores and eateries.",
        "Notable shops include 'Palestina Eretz Israel' on Olei Zion Street, offering nostalgic items reflecting Israel's history.",
        "The market has undergone gentrification, transforming from a traditional bazaar to a trendy area with boutiques and cafes.",
        "Nearby, the historic Abulafia Bakery, founded in 1879, is one of Israel's oldest businesses.",
        "The market's vibrant nightlife features outdoor entertainment and pop-up bars, especially on summer nights.",
        "The market is a hub for Soviet memorabilia, reflecting the diverse backgrounds of Jaffa's residents.",
        "The market's eclectic mix includes antiques, vintage clothing, and unique collectibles, attracting both locals and tourists."
      ]
    },
    {
      "name": "St. Peter's Church",
      "bullets": [
        "Built in 1654 atop a medieval citadel by Frederick I, restored by Louis IX.",
        "Destroyed twice in the late 18th century; current structure dates to 1894.",
        "Features stained glass by Franz Xaver Zettler depicting St. Peter's life.",
        "Pulpit carved as a lifelike tree, unique among church furnishings.",
        "Contains remnants of St. Louis' 13th-century citadel, including circular rooms.",
        "Napoleon Bonaparte stayed in these rooms during his 1799 campaign.",
        "Church faces west toward the sea, unlike traditional east-facing churches.",
        "Served as a beacon to pilgrims approaching Jaffa by sea.",
        "Masses conducted in English, Spanish, Polish, and Hebrew.",
        "Adjacent to the church is a statue of King Louis IX of France.",
        "Interior resembles European cathedrals with high vaulted ceilings and marble walls.",
        "Stained glass windows depict Spanish saints, reflecting Spanish sponsorship."
      ]
    },
    {
      "name": "Andromeda Rock",
      "bullets": [
        "Andromeda Rock is a prominent formation off Jaffa's coast, linked to Greek mythology.",
        "According to legend, Andromeda was chained here as a sacrifice to a sea monster.",
        "Perseus rescued Andromeda by slaying the monster, turning it to stone.",
        "Pliny the Elder noted marks on the rock from Andromeda's chains.",
        "The rock is visible from Jaffa's Old City, especially during low tide.",
        "Some legends claim Noah's grave lies beneath the rock.",
        "The British partially destroyed the rocks to expand Jaffa's harbor.",
        "Nearby, the Sea Mosque offers views of Andromeda Rock.",
        "Jaffa's port, near the rock, is one of the world's oldest harbors.",
        "The rock serves as a backdrop for photos, though no statue exists."
      ]
    },
    {
      "name": "Mahmoudiya Mosque",
      "bullets": [
        "Built in 1812 by Ottoman governor Muhammad Abu-Nabbut.",
        "Features Roman columns repurposed from Caesarea and Ashkelon.",
        "Contains a sabil attributed to Sulayman Pasha.",
        "Located near Jaffa's Clock Tower, enhancing its prominence.",
        "Served as a key religious site during Ottoman rule.",
        "Underwent restoration and maintenance completed in July 2016.",
        "Adjacent to the mosque is the Sabil Abu Nabbut fountain.",
        "The mosque's minaret remains a prominent feature in Jaffa's skyline.",
        "The mosque complex includes two large courtyards and a smaller one.",
        "The mosque's architecture reflects the elegant Ottoman style."
      ]
    },
    {
      "name": "Abrasha Park",
      "bullets": [
        "Established in 1970, Abrasha Park honors Avraham Shekhterman, former deputy mayor of Tel Aviv.",
        "The park's 'Gate of Faith' sculpture, created in 1975 by Daniel Kafri, depicts biblical scenes.",
        "Visitors can cross the Wishing Bridge, adorned with zodiac signs, and make a wish.",
        "The park offers panoramic views of Tel Aviv and the Mediterranean Sea.",
        "Napoleon's cannons, remnants from the 1799 campaign, are displayed within the park.",
        "The park's sundial features zodiac signs instead of numbers for timekeeping.",
        "Abrasha Park is a popular venue for weddings and cultural events.",
        "The park's design incorporates stones from former houses, blending history with nature.",
        "Adjacent to the park is St. Peter's Church, a significant historical landmark.",
        "The park's amphitheater hosts concerts and events, including the Jaffa Nights Festival."
      ]
    }
  ]
}